Revit 2020 API
UnitUtils.IsValidDisplayUnit Method (DisplayUnitType)
 Checks whether a display unit is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static bool IsValidDisplayUnit(
	DisplayUnitType displayUnit
)
Visual Basic
Public Shared Function IsValidDisplayUnit ( _
	displayUnit As DisplayUnitType _
) As Boolean
Visual C++
public:
static bool IsValidDisplayUnit(
	DisplayUnitType displayUnit
)
Parameters
displayUnit
Type: Autodesk.Revit.DB.DisplayUnitType
 The display unit to check.
Return Value
 True if the display unit is valid, false otherwise.
Remarks
 A display unit is considered valid if it is an actual unit like meters or feet. Obsolete values and the special values DUT_CUSTOM and DUT_UNDEFINED are not considered valid.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
UnitUtils Class
IsValidDisplayUnit Overload
Autodesk.Revit.DB Namespace